adpyke.codesnap
anysphere.cursorpyright
anysphere.remote-containers
anysphere.remote-ssh
asciidoctor.asciidoctor-vscode
asvetliakov.vscode-neovim
batisteo.vscode-django
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dtoplak.vscode-glsllint
eamodio.gitlens
elagil.pre-commit-helper
esbenp.prettier-vscode
formulahendry.code-runner
github.vscode-pull-request-github
kisstkondoros.vscode-gutter-preview
llvm-vs-code-extensions.vscode-clangd
mcu-debug.debug-tracker-vscode
mcu-debug.memory-view
mechatroner.rainbow-csv
mhutchie.git-graph
monokai.theme-monokai-pro-vscode
moshfeu.compare-folders
ms-ceintl.vscode-language-pack-zh-hans
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cpptools
ms-vscode.hexeditor
ms-vscode.live-server
ms-vscode.vscode-typescript-next
ngtystr.ppm-pgm-viewer-for-vscode
njpwerner.autodocstring
ritwickdey.liveserver
rust-lang.rust-analyzer
slevesque.shader
tamasfe.even-better-toml
tomoki1207.pdf
undefined_publisher.cursorpool
wayou.vscode-todo-highlight
wgsl-analyzer.wgsl-analyzer
wholroyd.jinja
xaver.clang-format
yzhang.markdown-all-in-one
